order-service/test.xml

<?xml version="1.0"?>

<soapenv:Envelope xmlns:sys="http://schemas.datacontract.org/2004/07/System.Drawing" 
    xmlns:psor="PSOrderingDOM.Classes" 
    xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays" 
    xmlns:sdm="http://schemas.datacontract.org/2004/07/SDM_SDK" 
    xmlns:tem="http://tempuri.org/" 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">

    <soapenv:Header/>
    <soapenv:Body>
        <tem:UpdateOrder>
            <tem:licenseCode>AmericanaWeb</tem:licenseCode>
            <tem:conceptID>3</tem:conceptID>
            <tem:order>

                <sdm:AddressID>10084110</sdm:AddressID>
                <sdm:AreaID>61</sdm:AreaID>
                <sdm:CityID>17</sdm:CityID>
                <sdm:ConceptID>3</sdm:ConceptID>
                <sdm:CountryID>1</sdm:CountryID>
                <sdm:CustomerID>7322542</sdm:CustomerID>
                <sdm:DateOfTrans>20191125T00:07:49</sdm:DateOfTrans>
                <sdm:DeliveryChargeID>279</sdm:DeliveryChargeID>
                <sdm:DistrictID>1</sdm:DistrictID>
                <sdm:DueTime>20191125T00:07:49</sdm:DueTime>


                <sdm:Entries>
                    <sdm:CEntry>

                        <sdm:DealID>0</sdm:DealID>


                        <sdm:Entries>


                            <sdm:CEntry>

                                <sdm:ID>0</sdm:ID>

                                <sdm:ItemID>810001</sdm:ItemID>

                                <sdm:ModCode>WITH</sdm:ModCode>

                                <sdm:ModgroupID>1</sdm:ModgroupID>

                                <sdm:Name>American Cheese</sdm:Name>

                                <sdm:OrdrMode>OM_SAVED</sdm:OrdrMode>

                                <sdm:Weight>0</sdm:Weight>

                            </sdm:CEntry>


                            <sdm:CEntry>

                                <sdm:ID>0</sdm:ID>

                                <sdm:ItemID>811701</sdm:ItemID>

                                <sdm:ModCode>WITH</sdm:ModCode>

                                <sdm:ModgroupID>1</sdm:ModgroupID>

                                <sdm:Name>Extra Iceberg Lettuce</sdm:Name>

                                <sdm:OrdrMode>OM_SAVED</sdm:OrdrMode>

                                <sdm:Weight>0</sdm:Weight>

                            </sdm:CEntry>


                            <sdm:CEntry>

                                <sdm:ID>0</sdm:ID>

                                <sdm:ItemID>811703</sdm:ItemID>

                                <sdm:ModCode>WITH</sdm:ModCode>

                                <sdm:ModgroupID>1</sdm:ModgroupID>

                                <sdm:Name>Extra Tomato</sdm:Name>

                                <sdm:Weight>0</sdm:Weight>

                            </sdm:CEntry>


                            <sdm:CEntry>

                                <sdm:ID>0</sdm:ID>

                                <sdm:ItemID>811703</sdm:ItemID>

                                <sdm:ModCode>WITH</sdm:ModCode>

                                <sdm:ModgroupID>1</sdm:ModgroupID>

                                <sdm:Name>Extra Tomato</sdm:Name>

                                <sdm:OrdrMode>OM_SAVED</sdm:OrdrMode>

                                <sdm:Weight>0</sdm:Weight>

                            </sdm:CEntry>


                            <sdm:CEntry>

                                <sdm:ID>0</sdm:ID>

                                <sdm:ItemID>510038</sdm:ItemID>

                                <sdm:ModCode>WITH</sdm:ModCode>

                                <sdm:ModgroupID>1</sdm:ModgroupID>

                                <sdm:Name>Coleslaw Small Add On</sdm:Name>

                                <sdm:Weight>0</sdm:Weight>

                            </sdm:CEntry>

                        </sdm:Entries>

                        <sdm:ID>0</sdm:ID>

                        <sdm:ItemID>110006</sdm:ItemID>

                        <sdm:ModCode>NONE</sdm:ModCode>

                        <sdm:Name>Twister BBQ Sandwich (O)</sdm:Name>

                        <sdm:QCComponent>1</sdm:QCComponent>

                        <sdm:QCInstanceID>855</sdm:QCInstanceID>

                        <sdm:QCLevel>0</sdm:QCLevel>

                        <sdm:QCProID>194</sdm:QCProID>

                    </sdm:CEntry>


                    <sdm:CEntry>

                        <sdm:DealID>0</sdm:DealID>

                        <sdm:ID>0</sdm:ID>

                        <sdm:ItemID>510050</sdm:ItemID>

                        <sdm:ModCode>NONE</sdm:ModCode>

                        <sdm:Name>Medium Fries</sdm:Name>

                        <sdm:QCComponent>2</sdm:QCComponent>

                        <sdm:QCInstanceID>855</sdm:QCInstanceID>

                        <sdm:QCLevel>0</sdm:QCLevel>

                        <sdm:QCProID>194</sdm:QCProID>

                    </sdm:CEntry>


                    <sdm:CEntry>

                        <sdm:DealID>0</sdm:DealID>

                        <sdm:ID>0</sdm:ID>

                        <sdm:ItemID>600003</sdm:ItemID>

                        <sdm:ModCode>NONE</sdm:ModCode>

                        <sdm:Name>Pepsi Medium</sdm:Name>

                        <sdm:QCComponent>3</sdm:QCComponent>

                        <sdm:QCInstanceID>855</sdm:QCInstanceID>

                        <sdm:QCLevel>0</sdm:QCLevel>

                        <sdm:QCProID>194</sdm:QCProID>

                    </sdm:CEntry>

                </sdm:Entries>

                <sdm:OrderID>0</sdm:OrderID>
                <sdm:OrderMode>1</sdm:OrderMode>
                <sdm:OrderType>0</sdm:OrderType>
                <sdm:ProvinceID>7</sdm:ProvinceID>
                <sdm:StoreID>95</sdm:StoreID>
                <sdm:StreetID>315</sdm:StreetID>
            </tem:order>
            <tem:autoApprove>1</tem:autoApprove>
            <tem:useBackupStoreIfAvailable>1</tem:useBackupStoreIfAvailable>
            <tem:orderNotes1>Test</tem:orderNotes1>
            <tem:orderNotes2>Orders</tem:orderNotes2>
            <tem:creditCardPaymentbool>false</tem:creditCardPaymentbool>
            <tem:isSuspended>0</tem:isSuspended>
            <tem:menuTemplateID>17</tem:menuTemplateID>
        </tem:UpdateOrder>

    </soapenv:Body>

</soapenv:Envelope>